// import { formValid } from "/js/modules/formValidation.min.js";

(function () {
   ("use strict");
   // --------------------------------Загрузка общих переменных---------------------------
   @@include('modules/_keys.js')
   // ------------------------------------------------------------------------------------

   // -------------Загрузка шрифтов через скрипт------------
   @@include('modules/_fonts.js')
   // ------------------------------------------------------

   // --------------------------------Загузка класса Аккардион----------------------------
   @@include('modules/_accordion.js')
   // ------------------------------------------------------------------------------------

   // --------------------------------Загрузка класса Валидации форм----------------------
   @@include('modules/_formValidation.js')
   // ------------------------------------------------------------------------------------

   // --------------------------------Загрузка класса Событий "касаний"----------------------
   @@include('modules/_eventTouch.js')
   // ------------------------------------------------------------------------------------

   
   // -----------Проверка валидация формы-------------------

   // const form1 = document.querySelector("form[novalidate]");
   // const form = new FormValid(form1);
   // console.log(form);
   FormValid.init();

   // ------------------------------------------------------
})();
